Courses/7140/Lectures/Languages/Scala-Java/Java-8/java-8-lambda-etc.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lambda Expressions, Etc. of Java 8</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Lambda Expressions, Etc. of Java 8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-01T12:46-0500"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="CS7140 Software Engineering Lecture"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div>

<div id="preamble">
<a href="../../Top/">CS 7140 Advanced Software Engineering</a>
</div>

<div id="content">
<h1 class="title">Lambda Expressions, Etc. of Java 8</h1>


<p>
TBD
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Java 8</a></li>
<li><a href="#sec-2">2 Functional interfaces</a></li>
<li><a href="#sec-3">3 Lambda expressions</a>
<ul>
<li><a href="#sec-3-1">3.1 Functions without Names (Lambda syntax)</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Java8 Functions without Names</a>
<ul>
<li><a href="#sec-4-1">4.1 Capturing</a></li>
<li><a href="#sec-4-2">4.2 TBD</a></li>
<li><a href="#sec-4-3">4.3 anonymous inner classes</a></li>
</ul>
</li>
<li><a href="#sec-5">5 A Collection Called <code>stream</code></a></li>
<li><a href="#sec-6">6 References</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Java 8</h2>
<div class="outline-text-2" id="text-1">


<ol>
<li>Java8 has several new things cf Java7
</li>
<li>Lambda Expressions, and 
</li>
<li>Functional Interfaces
</li>
<li>Interfaces can now define static methods.
</li>
<li>We highlight a few
</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Functional interfaces</h2>
<div class="outline-text-2" id="text-2">


<ol>
<li>A functional interface defines exactly one abstract method. 
</li>
<li><code>java.lang.Runnable</code><br/>
   <code>public abstract void run();</code>   abstract can be omitted

</li>
<li>TBD Default methods are not abstract, so a functional interface can
   define many.
</li>
</ol>




</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Lambda expressions</h2>
<div class="outline-text-2" id="text-3">


<ol>
<li>Alonzo Church, the Lambda Calculus, 1936
</li>
<li>Used the Greek &lambda; character
</li>
</ol>



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Functions without Names (Lambda syntax)</h3>
<div class="outline-text-3" id="text-3-1">


<ol>
<li>Suppose we have <code>f(x, y)</code> defined as <code>(x + 1)*(y + 2)</code>.  So, <code>f(3, 4)==24</code>.
</li>
<li>The anonymous version of f is: <code>lambda x, y: (x + 1)*(y + 2) ;</code>
</li>
<li>The f(3, 4) is written as <code>(lambda x, y: (x + 1)*(y + 2))(3, 4)</code>
</li>
<li>Function definition appears in-line with function-invocation.
</li>
<li>Another, but same, in-line def makes it another anonymous function
   that we happen to know is the same.
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Java8 Functions without Names</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li><code>(int x, int y) -&gt; { return (x + 1)*(y + 2); }</code>

</li>
<li><code>(x, y) -&gt; { (x + 1)*(y + 2); }</code> as above but with inferred types

</li>
<li><code>x -&gt; { System.out.println(x); }</code> 
   is an example of single parameter with inferred type on the left of
   the arrow, and a block with no return value on the rhs.

</li>
<li>Without Lambda exp



<pre class="src src-java"><span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">r1</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Runnable</span>() {
  <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">run</span>() {
    System.out.println(<span style="color: #8b2252;">"Running without Lambda"</span>);
  }
};
</pre>

<p>
   With Lambda exp
</p>


<pre class="src src-java"><span style="color: #228b22;">Runnable</span> <span style="color: #a0522d;">r2</span> = () -&gt; { System.out.println(<span style="color: #8b2252;">"Running with Lambda"</span>); };
</pre>

<p>
   No inputs.
</p>
</li>
<li>"burger arrow"



<pre class="src src-java"><span style="color: #a020f0;">for</span>(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>: getACollection()) {  <span style="color: #b22222;">// </span><span style="color: #b22222;">simple loop ...</span>
}

<span style="color: #a020f0;">for</span>(<span style="color: #228b22;">String</span> <span style="color: #a0522d;">s</span>: () -&gt; getAnIterator()) {  <span style="color: #b22222;">// </span><span style="color: #b22222;">not a simple loop ...</span>
}
</pre>


</li>
<li>Selecting persons based on some criteria



<pre class="src src-java">printPersons(
    roster, (Person <span style="color: #228b22;">p</span>) -&gt;
        p.getGender() == <span style="color: #008b8b;">Person</span>.<span style="color: #008b8b;">Sex</span>.MALE &amp;&amp; p.getAge() &gt;= 18
);
</pre>

<p>
  tight binding TBD
</p></li>
</ol>



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Capturing</h3>
<div class="outline-text-3" id="text-4-1">


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> TBD</h3>
<div class="outline-text-3" id="text-4-2">


<p>
<a href="http://www.techempower.com/blog/2013/03/26/everything-about-java-8/">http://www.techempower.com/blog/2013/03/26/everything-about-java-8/</a>
has several lambda examples.  but not very good at explanations
</p>
<p>
<a href="http://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html">http://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html</a>
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> anonymous inner classes</h3>
<div class="outline-text-3" id="text-4-3">

<p><a href="http://docs.oracle.com/javase/tutorial/java/javaOO/anonymousclasses.html">http://docs.oracle.com/javase/tutorial/java/javaOO/anonymousclasses.html</a>
</p>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> A Collection Called <code>stream</code></h2>
<div class="outline-text-2" id="text-5">


<p>
Using a sequential stream:
</p>
<p>
List &lt;Person&gt; people = list.getStream.collect(Collectors.toList());
</p>
<p>
Using a parallel stream:
</p>
<p>
List &lt;Person&gt; people = list.getStream.parallel().collect(Collectors.toList());
</p>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">


<ol>
<li><a href="http://docs.oracle.com/javase/tutorial/java/javaOO/nested.html">http://docs.oracle.com/javase/tutorial/java/javaOO/nested.html</a>
   Nested Classes [from the Java Tutorial].  Required Reading.
</li>
</ol>


<p>
<a href="https://blogs.oracle.com/thejavatutorials/entry/jdk_8_documentation_developer_preview#security">https://blogs.oracle.com/thejavatutorials/entry/jdk\_8\_documentation\_developer\_preview#security</a>
</p>
</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
